import 'package:flutter/material.dart';
import 'package:iti_final_project/components/zkr_card.dart';
import '../components/zkr_text.dart';

class Hadis extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: const Color(0xffA4593C),
        title: ZkrText(txt: 'ألأحاديث النبوية',size: 18)
      ),
      body: SingleChildScrollView(
        child: Column(
          children: [

            ZkrCard(
              Name: 'رواه البخاري ومسلم',
              zkr:
                  'سَمِعْتُ رَسولَ اللَّهِ -صَلَّى اللهُ عليه وسلَّمَ- يقولُ: إذَا رَأَيْتُمُوهُ فَصُومُوا، وإذَا رَأَيْتُمُوهُ فأفْطِرُوا، فإنْ غُمَّ علَيْكُم فَاقْدُرُوا',
            ),
            ZkrCard(
              Name: 'رواه البخاري ومسلم',
              zkr:
                  'ثبت عن عائشة -رضي الله عنها- أنها قالت: (كُنْتُ أنَامُ بيْنَ يَدَيْ رَسولِ اللَّهِ -صَلَّى اللهُ عليه وسلَّمَ- ورِجْلَايَ في قِبْلَتِهِ، فَإِذَا سَجَدَ غَمَزَنِي، فَقَبَضْتُ رِجْلَيَّ، فَإِذَا قَامَ بَسَطْتُهُمَا، قالَتْ: والبُيُوتُ يَومَئذٍ ليسَ فِيهَا مَصَابِيحُ)',
            ),
            ZkrCard(
              Name: 'رواه البخاري ومسلم',
              zkr:
                  'ثبت عن أبي هريرة -رضي الله عنه- أن رسول الله -صلى الله عليه وسلم- سُئِلَ: (أَيُّ الصَّلَاةِ أَفْضَلُ بَعْدَ المَكْتُوبَةِ؟ وَأَيُّ الصِّيَامِ أَفْضَلُ بَعْدَ شَهْرِ رَمَضَانَ؟ فَقالَ: أَفْضَلُ الصَّلَاةِ، بَعْدَ الصَّلَاةِ المَكْتُوبَةِ، الصَّلَاةُ في جَوْفِ اللَّيْلِ، وَأَفْضَلُ الصِّيَامِ بَعْدَ شَهْرِ رَمَضَانَ، صِيَامُ شَهْرِ اللهِ المُحَرَّمِ).',
            ),
            ZkrCard(
              Name: 'رواه البخاري ومسلم',
              zkr:
                  'ثبت عن أبي هريرة -رضي الله عنه- أنّه سمع رسول الله -صلى الله عليه وسلم- يقول: (أنَّهُ سَمِعَ رَسولَ اللَّهِ -صَلَّى اللهُ عليه وسلَّمَ- يقولُ: أرَأَيْتُمْ لو أنَّ نَهَرًا ببابِ أحَدِكُمْ يَغْتَسِلُ فيه كُلَّ يَومٍ خَمْسًا، ما تَقُولُ ذلكَ يُبْقِي مِن دَرَنِهِ؟ قالوا: لا يُبْقِي مِن دَرَنِهِ شيئًا، قالَ: فَذلكَ مِثْلُ الصَّلَواتِ الخَمْسِ، يَمْحُو اللَّهُ به الخَطايا).',
            ),
            ZkrCard(
              Name: 'رواه البخاري ومسلم',
              zkr:
                  'ثبت عن عبد الله بن عمر -رضي الله عنه- أنه قال: (سَمِعْتُ رَسولَ اللَّهِ -صَلَّى اللهُ عليه وسلَّمَ- يقولُ: إذَا رَأَيْتُمُوهُ فَصُومُوا، وإذَا رَأَيْتُمُوهُ فأفْطِرُوا، فإنْ غُمَّ علَيْكُم فَاقْدُرُوا له)',
            ),
            ZkrCard(
              Name: 'رواه البخاري ومسلم',
              zkr:
                  'قال رسول الله -صلى الله عليه وسلم-: (كُلُّ عَمَلِ ابْنِ آدَمَ يُضَاعَفُ، الحَسَنَةُ عَشْرُ أَمْثَالِهَا إلى سَبْعمِئَة ضِعْفٍ، قالَ اللَّهُ -عَزَّ وَجَلَّ-: إلَّا الصَّوْمَ، فإنَّه لي وَأَنَا أَجْزِي به، يَدَعُ شَهْوَتَهُ وَطَعَامَهُ مِن أَجْلِي لِلصَّائِمِ فَرْحَتَانِ: فَرْحَةٌ عِنْدَ فِطْرِهِ، وَفَرْحَةٌ عِنْدَ لِقَاءِ رَبِّهِ وَلَخُلُوفُ فيه أَطْيَبُ عِنْدَ اللهِ مِن رِيحِ المِسْكِ).',
            ),
            ZkrCard(
              Name: 'رواه البخاري ومسلم',
              zkr:
                  'قال رسول الله -صلى الله عليه وسلم-: (فِي الجَنَّةِ ثَمَانِيَةُ أبْوَابٍ، فِيهَا بَابٌ يُسَمَّى الرَّيَّانَ، لا يَدْخُلُهُ إلَّا الصَّائِمُونَ)',
            ),
            ZkrCard(
              Name: 'رواه البخاري ومسلم',
              zkr:
                  'ثبت عن عبد الله بن عمر -رضي الله عنه- أنه قال: (لَمْ يَكُنْ رَسولُ اللَّهِ -صَلَّى اللهُ عليه وسلَّمَ- فَاحِشًا ولَا مُتَفَحِّشًا، وإنَّه كانَ يقولُ: إنَّ خِيَارَكُمْ أحَاسِنُكُمْ أخْلَاقًا)',
            ),
            ZkrCard(
              Name: 'رواه البخاري ومسلم',
              zkr:
                  'قال رسول الله -صلى الله عليه وسلم-: (يَا أَيُّهَا النَّاسُ تُوبُوا إلى اللهِ، فإنِّي أَتُوبُ في اليَومِ إلَيْهِ مِئَةَ مَرَّةٍ)',
            ),
            ZkrCard(
              Name: 'رواه البخاري ومسلم',
              zkr:
                  'قال رسول الله -صلى الله عليه وسلم-: (وَالَّذِي نَفْسِي بِيَدِهِ لو لَمْ تُذْنِبُوا لَذَهَبَ اللَّهُ بِكُمْ، وَلَجَاءَ بِقَوْمٍ يُذْنِبُونَ، فَيَسْتَغْفِرُونَ اللَّهَ فَيَغْفِرُ لهمْ)',
            ),
            ZkrCard(
              Name: 'رواه البخاري ومسلم',
              zkr:
                  'قال رسول الله -صلى الله عليه وسلم-: (لَقَابُ قَوْسِ أحَدِكُمْ -أوْ مَوْضِعُ قَدَمٍ- مِنَ الجَنَّةِ، خَيْرٌ مِنَ الدُّنْيَا وما فِيهَا، ولو أنَّ امْرَأَةً مِن نِسَاءِ أهْلِ الجَنَّةِ اطَّلَعَتْ إلى الأرْضِ لَأَضَاءَتْ ما بيْنَهُمَا، ولَمَلَأَتْ ما بيْنَهُما رِيحًا، ولَنَصِيفُهَا -يَعْنِي الخِمَارَ- خَيْرٌ مِنَ الدُّنْيَا وما فِيهَا)',
            ),
            ZkrCard(
              Name: 'رواه البخاري ومسلم',
              zkr:
                  'عن عروة أن عائشة قالت : لقد كان رسول الله صلى الله عليه وسلم يصلي الفجر فيشهد معه نساء من المؤمنات متلفعات في مروطهن ثم يرجعن إلى بيوتهن ما يعرفهن أحد',
            ),
            ZkrCard(
              Name: 'رواه البخاري ومسلم',
              zkr:
                  'حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، أَخْبَرَنَا هِشَامُ بْنُ يُوسُفَ، أَنَّ ابْنَ جُرَيْجٍ، أَخْبَرَهُمْ قَالَ أَخْبَرَنِي عَطَاءٌ، قَالَ حَضَرْنَا مَعَ ابْنِ عَبَّاسٍ جَنَازَةَ مَيْمُونَةَ بِسَرِفَ، فَقَالَ ابْنُ عَبَّاسٍ هَذِهِ زَوْجَةُ النَّبِيِّ صلى الله عليه وسلم فَإِذَا رَفَعْتُمْ نَعْشَهَا فَلاَ تُزَعْزِعُوهَا وَلاَ تُزَلْزِلُوهَا وَارْفُقُوا، فَإِنَّهُ كَانَ عِنْدَ النَّبِيِّ صلى الله عليه وسلم تِسْعٌ، كَانَ يَقْسِمُ لِثَمَانٍ وَلاَ يَقْسِمُ لِوَاحِدَةٍ',
            ),
            ZkrCard(
              Name: 'رواه البخاري ومسلم',
              zkr:
                  'حَدَّثَنَا يَحْيَى بْنُ قَزَعَةَ، حَدَّثَنَا مَالِكٌ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ بْنِ الْحَارِثِ، عَنْ عَلْقَمَةَ بْنِ وَقَّاصٍ، عَنْ عُمَرَ بْنِ الْخَطَّابِ ـ رضى الله عنه ـ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏"‏ الْعَمَلُ بِالنِّيَّةِ، وَإِنَّمَا لاِمْرِئٍ مَا نَوَى، فَمَنْ كَانَتْ هِجْرَتُهُ إِلَى اللَّهِ وَرَسُولِهِ فَهِجْرَتُهُ إِلَى اللَّهِ وَرَسُولِهِ صلى الله عليه وسلم وَمَنْ كَانَتْ هِجْرَتُهُ إِلَى دُنْيَا يُصِيبُهَا أَوِ امْرَأَةٍ يَنْكِحُهَا، فَهِجْرَتُهُ إِلَى مَا هَاجَرَ إِلَيْهِ',
            ),
            ZkrCard(
              Name: 'رواه البخاري ومسلم',
              zkr:
                  'عن ابن عباس، أنه رأى النبي صلى الله عليه وسلم نام وهو ساجد، حتى غط أو نفخ، ثم قام يصلي، فقلت: يا رسول الله، إنك قد نمت، قال: «إن الوضوء لا يجب إلا على من نام مضطجعا، فإنه إذا اضطجع استرخت مفاصله»',
            ),
            ZkrCard(
              Name: 'سنن الترميزي',
              zkr:
                  'عن النبي صلى الله عليه وسلم أنه قال: «من توضأ على طهر كتب الله له به عشر حسنات»',
            ),
            ZkrCard(
              Name: 'سنن الترميزي',
              zkr:
                  'عن أبي هريرة، قال: قال رسول الله صلى الله عليه وسلم: «لولا أن أشق على أمتي لأمرتهم بالسواك عند كل صلاة»',
            ),
          ],
        ),
      ),
    );
  }
}
